zephyrproject-rtos/hal_microchip/sam/sam_d5x_e5x/atsame53/include/component/tcc.h
/* -------- TCC_STATUS : (TCC Offset: 0x30) (R/W 32) Status -------- */
#define TCC_STATUS_RESETVALUE                 _UINT32_(0x01)                                       /*  (TCC_STATUS) Status  Reset Value */

#define TCC_STATUS_STOP_Pos                   _UINT32_(0)                                          /* (TCC_STATUS) Stop Position */
#define TCC_STATUS_STOP_Msk                   (_UINT32_(0x1) << TCC_STATUS_STOP_Pos)               /* (TCC_STATUS) Stop Mask */
#define TCC_STATUS_STOP(value)                (TCC_STATUS_STOP_Msk & (_UINT32_(value) << TCC_STATUS_STOP_Pos)) /* Assignment of value for STOP in the TCC_STATUS register */
#define TCC_STATUS_IDX_Pos                    _UINT32_(1)                                          /* (TCC_STATUS) Ramp Position */
#define TCC_STATUS_IDX_Msk                    (_UINT32_(0x1) << TCC_STATUS_IDX_Pos)                /* (TCC_STATUS) Ramp Mask */
#define TCC_STATUS_IDX(value)                 (TCC_STATUS_IDX_Msk & (_UINT32_(value) << TCC_STATUS_IDX_Pos)) /* Assignment of value for IDX in the TCC_STATUS register */
#define TCC_STATUS_UFS_Pos                    _UINT32_(2)                                          /* (TCC_STATUS) Non-recoverable Update Fault State Position */
#define TCC_STATUS_UFS_Msk                    (_UINT32_(0x1) << TCC_STATUS_UFS_Pos)                /* (TCC_STATUS) Non-recoverable Update Fault State Mask */
#define TCC_STATUS_UFS(value)                 (TCC_STATUS_UFS_Msk & (_UINT32_(value) << TCC_STATUS_UFS_Pos)) /* Assignment of value for UFS in the TCC_STATUS register */
#define TCC_STATUS_DFS_Pos                    _UINT32_(3)                                          /* (TCC_STATUS) Non-Recoverable Debug Fault State Position */
#define TCC_STATUS_DFS_Msk                    (_UINT32_(0x1) << TCC_STATUS_DFS_Pos)                /* (TCC_STATUS) Non-Recoverable Debug Fault State Mask */
#define TCC_STATUS_DFS(value)                 (TCC_STATUS_DFS_Msk & (_UINT32_(value) << TCC_STATUS_DFS_Pos)) /* Assignment of value for DFS in the TCC_STATUS register */
#define TCC_STATUS_SLAVE_Pos                  _UINT32_(4)                                          /* (TCC_STATUS) Slave Position */
#define TCC_STATUS_SLAVE_Msk                  (_UINT32_(0x1) << TCC_STATUS_SLAVE_Pos)              /* (TCC_STATUS) Slave Mask */
#define TCC_STATUS_SLAVE(value)               (TCC_STATUS_SLAVE_Msk & (_UINT32_(value) << TCC_STATUS_SLAVE_Pos)) /* Assignment of value for SLAVE in the TCC_STATUS register */
#define TCC_STATUS_PATTBUFV_Pos               _UINT32_(5)                                          /* (TCC_STATUS) Pattern Buffer Valid Position */
#define TCC_STATUS_PATTBUFV_Msk               (_UINT32_(0x1) << TCC_STATUS_PATTBUFV_Pos)           /* (TCC_STATUS) Pattern Buffer Valid Mask */
#define TCC_STATUS_PATTBUFV(value)            (TCC_STATUS_PATTBUFV_Msk & (_UINT32_(value) << TCC_STATUS_PATTBUFV_Pos)) /* Assignment of value for PATTBUFV in the TCC_STATUS register */
#define TCC_STATUS_PERBUFV_Pos                _UINT32_(7)                                          /* (TCC_STATUS) Period Buffer Valid Position */
#define TCC_STATUS_PERBUFV_Msk                (_UINT32_(0x1) << TCC_STATUS_PERBUFV_Pos)            /* (TCC_STATUS) Period Buffer Valid Mask */
#define TCC_STATUS_PERBUFV(value)             (TCC_STATUS_PERBUFV_Msk & (_UINT32_(value) << TCC_STATUS_PERBUFV_Pos)) /* Assignment of value for PERBUFV in the TCC_STATUS register */
#define TCC_STATUS_FAULTAIN_Pos               _UINT32_(8)                                          /* (TCC_STATUS) Recoverable Fault A Input Position */
#define TCC_STATUS_FAULTAIN_Msk               (_UINT32_(0x1) << TCC_STATUS_FAULTAIN_Pos)           /* (TCC_STATUS) Recoverable Fault A Input Mask */
#define TCC_STATUS_FAULTAIN(value)            (TCC_STATUS_FAULTAIN_Msk & (_UINT32_(value) << TCC_STATUS_FAULTAIN_Pos)) /* Assignment of value for FAULTAIN in the TCC_STATUS register */
#define TCC_STATUS_FAULTBIN_Pos               _UINT32_(9)                                          /* (TCC_STATUS) Recoverable Fault B Input Position */
#define TCC_STATUS_FAULTBIN_Msk               (_UINT32_(0x1) << TCC_STATUS_FAULTBIN_Pos)           /* (TCC_STATUS) Recoverable Fault B Input Mask */
#define TCC_STATUS_FAULTBIN(value)            (TCC_STATUS_FAULTBIN_Msk & (_UINT32_(value) << TCC_STATUS_FAULTBIN_Pos)) /* Assignment of value for FAULTBIN in the TCC_STATUS register */
#define TCC_STATUS_FAULT0IN_Pos               _UINT32_(10)                                         /* (TCC_STATUS) Non-Recoverable Fault0 Input Position */
#define TCC_STATUS_FAULT0IN_Msk               (_UINT32_(0x1) << TCC_STATUS_FAULT0IN_Pos)           /* (TCC_STATUS) Non-Recoverable Fault0 Input Mask */
#define TCC_STATUS_FAULT0IN(value)            (TCC_STATUS_FAULT0IN_Msk & (_UINT32_(value) << TCC_STATUS_FAULT0IN_Pos)) /* Assignment of value for FAULT0IN in the TCC_STATUS register */
#define TCC_STATUS_FAULT1IN_Pos               _UINT32_(11)                                         /* (TCC_STATUS) Non-Recoverable Fault1 Input Position */
#define TCC_STATUS_FAULT1IN_Msk               (_UINT32_(0x1) << TCC_STATUS_FAULT1IN_Pos)           /* (TCC_STATUS) Non-Recoverable Fault1 Input Mask */
#define TCC_STATUS_FAULT1IN(value)            (TCC_STATUS_FAULT1IN_Msk & (_UINT32_(value) << TCC_STATUS_FAULT1IN_Pos)) /* Assignment of value for FAULT1IN in the TCC_STATUS register */
#define TCC_STATUS_FAULTA_Pos                 _UINT32_(12)                                         /* (TCC_STATUS) Recoverable Fault A State Position */
#define TCC_STATUS_FAULTA_Msk                 (_UINT32_(0x1) << TCC_STATUS_FAULTA_Pos)             /* (TCC_STATUS) Recoverable Fault A State Mask */
#define TCC_STATUS_FAULTA(value)              (TCC_STATUS_FAULTA_Msk & (_UINT32_(value) << TCC_STATUS_FAULTA_Pos)) /* Assignment of value for FAULTA in the TCC_STATUS register */
#define TCC_STATUS_FAULTB_Pos                 _UINT32_(13)                                         /* (TCC_STATUS) Recoverable Fault B State Position */
#define TCC_STATUS_FAULTB_Msk                 (_UINT32_(0x1) << TCC_STATUS_FAULTB_Pos)             /* (TCC_STATUS) Recoverable Fault B State Mask */
#define TCC_STATUS_FAULTB(value)              (TCC_STATUS_FAULTB_Msk & (_UINT32_(value) << TCC_STATUS_FAULTB_Pos)) /* Assignment of value for FAULTB in the TCC_STATUS register */
#define TCC_STATUS_FAULT0_Pos                 _UINT32_(14)                                         /* (TCC_STATUS) Non-Recoverable Fault 0 State Position */
#define TCC_STATUS_FAULT0_Msk                 (_UINT32_(0x1) << TCC_STATUS_FAULT0_Pos)             /* (TCC_STATUS) Non-Recoverable Fault 0 State Mask */
#define TCC_STATUS_FAULT0(value)              (TCC_STATUS_FAULT0_Msk & (_UINT32_(value) << TCC_STATUS_FAULT0_Pos)) /* Assignment of value for FAULT0 in the TCC_STATUS register */
#define TCC_STATUS_FAULT1_Pos                 _UINT32_(15)                                         /* (TCC_STATUS) Non-Recoverable Fault 1 State Position */
#define TCC_STATUS_FAULT1_Msk                 (_UINT32_(0x1) << TCC_STATUS_FAULT1_Pos)             /* (TCC_STATUS) Non-Recoverable Fault 1 State Mask */
#define TCC_STATUS_FAULT1(value)              (TCC_STATUS_FAULT1_Msk & (_UINT32_(value) << TCC_STATUS_FAULT1_Pos)) /* Assignment of value for FAULT1 in the TCC_STATUS register */
#define TCC_STATUS_CCBUFV0_Pos                _UINT32_(16)                                         /* (TCC_STATUS) Compare Channel 0 Buffer Valid Position */
#define TCC_STATUS_CCBUFV0_Msk                (_UINT32_(0x1) << TCC_STATUS_CCBUFV0_Pos)            /* (TCC_STATUS) Compare Channel 0 Buffer Valid Mask */
#define TCC_STATUS_CCBUFV0(value)             (TCC_STATUS_CCBUFV0_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV0_Pos)) /* Assignment of value for CCBUFV0 in the TCC_STATUS register */
#define TCC_STATUS_CCBUFV1_Pos                _UINT32_(17)                                         /* (TCC_STATUS) Compare Channel 1 Buffer Valid Position */
#define TCC_STATUS_CCBUFV1_Msk                (_UINT32_(0x1) << TCC_STATUS_CCBUFV1_Pos)            /* (TCC_STATUS) Compare Channel 1 Buffer Valid Mask */
#define TCC_STATUS_CCBUFV1(value)             (TCC_STATUS_CCBUFV1_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV1_Pos)) /* Assignment of value for CCBUFV1 in the TCC_STATUS register */
#define TCC_STATUS_CCBUFV2_Pos                _UINT32_(18)                                         /* (TCC_STATUS) Compare Channel 2 Buffer Valid Position */
#define TCC_STATUS_CCBUFV2_Msk                (_UINT32_(0x1) << TCC_STATUS_CCBUFV2_Pos)            /* (TCC_STATUS) Compare Channel 2 Buffer Valid Mask */
#define TCC_STATUS_CCBUFV2(value)             (TCC_STATUS_CCBUFV2_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV2_Pos)) /* Assignment of value for CCBUFV2 in the TCC_STATUS register */
#define TCC_STATUS_CCBUFV3_Pos                _UINT32_(19)                                         /* (TCC_STATUS) Compare Channel 3 Buffer Valid Position */
#define TCC_STATUS_CCBUFV3_Msk                (_UINT32_(0x1) << TCC_STATUS_CCBUFV3_Pos)            /* (TCC_STATUS) Compare Channel 3 Buffer Valid Mask */
#define TCC_STATUS_CCBUFV3(value)             (TCC_STATUS_CCBUFV3_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV3_Pos)) /* Assignment of value for CCBUFV3 in the TCC_STATUS register */
#define TCC_STATUS_CCBUFV4_Pos                _UINT32_(20)                                         /* (TCC_STATUS) Compare Channel 4 Buffer Valid Position */
#define TCC_STATUS_CCBUFV4_Msk                (_UINT32_(0x1) << TCC_STATUS_CCBUFV4_Pos)            /* (TCC_STATUS) Compare Channel 4 Buffer Valid Mask */
#define TCC_STATUS_CCBUFV4(value)             (TCC_STATUS_CCBUFV4_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV4_Pos)) /* Assignment of value for CCBUFV4 in the TCC_STATUS register */
#define TCC_STATUS_CCBUFV5_Pos                _UINT32_(21)                                         /* (TCC_STATUS) Compare Channel 5 Buffer Valid Position */
#define TCC_STATUS_CCBUFV5_Msk                (_UINT32_(0x1) << TCC_STATUS_CCBUFV5_Pos)            /* (TCC_STATUS) Compare Channel 5 Buffer Valid Mask */
#define TCC_STATUS_CCBUFV5(value)             (TCC_STATUS_CCBUFV5_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV5_Pos)) /* Assignment of value for CCBUFV5 in the TCC_STATUS register */
#define TCC_STATUS_CMP0_Pos                   _UINT32_(24)                                         /* (TCC_STATUS) Compare Channel 0 Value Position */
#define TCC_STATUS_CMP0_Msk                   (_UINT32_(0x1) << TCC_STATUS_CMP0_Pos)               /* (TCC_STATUS) Compare Channel 0 Value Mask */
#define TCC_STATUS_CMP0(value)                (TCC_STATUS_CMP0_Msk & (_UINT32_(value) << TCC_STATUS_CMP0_Pos)) /* Assignment of value for CMP0 in the TCC_STATUS register */
#define TCC_STATUS_CMP1_Pos                   _UINT32_(25)                                         /* (TCC_STATUS) Compare Channel 1 Value Position */
#define TCC_STATUS_CMP1_Msk                   (_UINT32_(0x1) << TCC_STATUS_CMP1_Pos)               /* (TCC_STATUS) Compare Channel 1 Value Mask */
#define TCC_STATUS_CMP1(value)                (TCC_STATUS_CMP1_Msk & (_UINT32_(value) << TCC_STATUS_CMP1_Pos)) /* Assignment of value for CMP1 in the TCC_STATUS register */
#define TCC_STATUS_CMP2_Pos                   _UINT32_(26)                                         /* (TCC_STATUS) Compare Channel 2 Value Position */
#define TCC_STATUS_CMP2_Msk                   (_UINT32_(0x1) << TCC_STATUS_CMP2_Pos)               /* (TCC_STATUS) Compare Channel 2 Value Mask */
#define TCC_STATUS_CMP2(value)                (TCC_STATUS_CMP2_Msk & (_UINT32_(value) << TCC_STATUS_CMP2_Pos)) /* Assignment of value for CMP2 in the TCC_STATUS register */
#define TCC_STATUS_CMP3_Pos                   _UINT32_(27)                                         /* (TCC_STATUS) Compare Channel 3 Value Position */
#define TCC_STATUS_CMP3_Msk                   (_UINT32_(0x1) << TCC_STATUS_CMP3_Pos)               /* (TCC_STATUS) Compare Channel 3 Value Mask */
#define TCC_STATUS_CMP3(value)                (TCC_STATUS_CMP3_Msk & (_UINT32_(value) << TCC_STATUS_CMP3_Pos)) /* Assignment of value for CMP3 in the TCC_STATUS register */
#define TCC_STATUS_CMP4_Pos                   _UINT32_(28)                                         /* (TCC_STATUS) Compare Channel 4 Value Position */
#define TCC_STATUS_CMP4_Msk                   (_UINT32_(0x1) << TCC_STATUS_CMP4_Pos)               /* (TCC_STATUS) Compare Channel 4 Value Mask */
#define TCC_STATUS_CMP4(value)                (TCC_STATUS_CMP4_Msk & (_UINT32_(value) << TCC_STATUS_CMP4_Pos)) /* Assignment of value for CMP4 in the TCC_STATUS register */
#define TCC_STATUS_CMP5_Pos                   _UINT32_(29)                                         /* (TCC_STATUS) Compare Channel 5 Value Position */
#define TCC_STATUS_CMP5_Msk                   (_UINT32_(0x1) << TCC_STATUS_CMP5_Pos)               /* (TCC_STATUS) Compare Channel 5 Value Mask */
#define TCC_STATUS_CMP5(value)                (TCC_STATUS_CMP5_Msk & (_UINT32_(value) << TCC_STATUS_CMP5_Pos)) /* Assignment of value for CMP5 in the TCC_STATUS register */
#define TCC_STATUS_Msk                        _UINT32_(0x3F3FFFBF)                                 /* (TCC_STATUS) Register Mask  */

